Revit 2027 API
BuiltInFailures.ImportFailures.ImportContainedUnsupportedGeometricData Property
 The original model contains unsupported geometric data.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ImportContainedUnsupportedGeometricData { get; }
Public Shared ReadOnly Property ImportContainedUnsupportedGeometricData As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ImportContainedUnsupportedGeometricData {
	FailureDefinitionId^ get ();
}
static member ImportContainedUnsupportedGeometricData : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ImportFailures Class
Autodesk.Revit.DB Namespace